# 1-1 숫자 자료형
# print(5)
# print(-10)
# print(3.14)
# print(1000)
# print(5+3)
# print(2*8)
# print(3*(3+1))
# 곱셈은 *, 복잡한 괄호연산도 가능
#-----------------------------------
# 1-2 문자열 자료형
# print('풍선')
# print('나비')
# print('ㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋ')
# print("ㅋ"*24)
#-----------------------------------
# 1-3 Boolean 자료형 (참/거짓)
# print(5>10)
# print(5<10)
# print(True)
# print(False)
# print(not True)
# print(not False)
# print(not (5>10))
#------------------------
# 1-4 변수

# animal = "개"
# name = "달이"
# age = 4
# hobby = "축구"
# fact_adult = age >= 3
# print("우리집"+ animal + "이름은" + name + "에요")
# print(name+"는" +str(age)+ "살이며, " +hobby+ "를 아주 좋아해요")
# print(name+ "는 어른일까요? " + str(fact_adult))
#---------------------------------------------
#1-5 주석
# 주석할 문장들을 모두 드래그하고, ctrl+/ 하면 쉽게 주석처리됨
# ''' 주석할 내용''' 하면 띄어쓰기가 된 여러 문장도 주석처리가능,
#----------------------------------------------------------------
#1-6 Quiz
# 변수 이용해서 다음 문장 출력하기
station = "사당"# 신도림 인천공항으로 바꿔주면 끝
print(station + " 행 열차가 들어오고 있습니다.")
