'''
#Unit 10-1
person = ['james', 17, 175.3, True]

a = list(range(10))
print(a) # [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

b = list(range(-1, 5, 4))
print(b) # [-1, 3]
'''
#-------------
'''
#Unit 10-2
a = 38, # 1개짜리 튜플

b = [1, 2, 3]
print(b,type(b)) # [1, 2, 3] <class 'list'>
b = tuple(b)
print(b,type(b)) # (1, 2, 3) <class 'tuple'>

c= list("hello")
print(c) # ['h', 'e', 'l', 'l', 'o']
'''
#-----------------
'''
a = list(range(10))
print(a) # [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

a[2:3] =["하은","규리","호영", "지원","규환"] 
print(a) # [0, 1, '하은', '규리', '호영', '지원', '규환', 3, 4, 5, 6, 7, 8, 9]
'''
#---------
'''
#Unit 12

# dict를 쓸 경우, key값에는 작은따음표나 큰 따음표 x 
딕셔너리 = dict(호영 = "딜러", 지원="힐러") 
print(딕셔너리)
# 방법1
호빡이의능력치 = dict(힘=100, 민첩=350, 체력=320, 지능=200, 인성=10000)
print(호빡이의능력치)
# 방법2
호빡이의능력치 = dict(zip(['힘','민첩','체력','지능','인성'], [100,350,320,200,10000]))
print(호빡이의능력치)
# 방법3
호빡이의능력치 = dict([('힘', 100),('민첩', 350),('체력',300),('지능',200),('인성',10000)])
print(호빡이의능력치)
# 방법4
호빡이의능력치 = {'힘': 100, '민첩' :350, '체력' : 320, '지능' : 200, 인성: 10000}
'''
#--------------------------
key = input().split()
value = map(float,input().split())

charac =dict(zip(key, value))
print(charac)